### ```Annova Test ```:

Anova ( Analysis of variance ) is used to compare means of more then two independent groups to check if at least one group is significantly different.

In [20]:
import seaborn as sns
import pandas as pd 
from scipy.stats import f_oneway

In [21]:
df  = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [22]:
df = df[["pclass" , "age"]].dropna()

In [23]:
df['pclass'].unique()

array([3, 1, 2], dtype=int64)

In [24]:
class1 = df[df["pclass"] == 1]["age"]
class2 = df[df["pclass"] == 2]["age"]
class3 = df[df["pclass"] == 3]["age"]

In [25]:
f_stats , p_value = f_oneway(class1 , class2 , class3)
print(f_stats , p_value)

57.443484340676214 7.487984171959904e-24

In [26]:
alpha = 0.05

if p_value < alpha:
    print("reject null hypothesis which means there is a significant difference between at least one passenger class")
else:
    print("accept null hypothesis which means no significant difference between at least one passenger class")

reject null hypothesis which means there is a significant difference between at least one passenger class